TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_spi.h
/* SPI_GPRCM_STAT Bits */
/* SPI_GPRCM_STAT[RESETSTKY] Bits */
#define SPI_GPRCM_STAT_RESETSTKY_OFS             (16)                            /* !< RESETSTKY Offset */
#define SPI_GPRCM_STAT_RESETSTKY_MASK            ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define SPI_GPRCM_STAT_RESETSTKY_NORES           ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define SPI_GPRCM_STAT_RESETSTKY_RESET           ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* SPI_CLKDIV Bits */
/* SPI_CLKDIV[RATIO] Bits */
#define SPI_CLKDIV_RATIO_OFS                     (0)                             /* !< RATIO Offset */
#define SPI_CLKDIV_RATIO_MASK                    ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock */
#define SPI_CLKDIV_RATIO_DIV_BY_1                ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define SPI_CLKDIV_RATIO_DIV_BY_2                ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define SPI_CLKDIV_RATIO_DIV_BY_3                ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define SPI_CLKDIV_RATIO_DIV_BY_4                ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define SPI_CLKDIV_RATIO_DIV_BY_5                ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define SPI_CLKDIV_RATIO_DIV_BY_6                ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define SPI_CLKDIV_RATIO_DIV_BY_7                ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define SPI_CLKDIV_RATIO_DIV_BY_8                ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */

/* SPI_CLKSEL Bits */
/* SPI_CLKSEL[LFCLK_SEL] Bits */
#define SPI_CLKSEL_LFCLK_SEL_OFS                 (1)                             /* !< LFCLK_SEL Offset */
#define SPI_CLKSEL_LFCLK_SEL_MASK                ((uint32_t)0x00000002U)         /* !< Selects LFCLK as clock source if
                                                                                    enabled */
#define SPI_CLKSEL_LFCLK_SEL_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPI_CLKSEL_LFCLK_SEL_ENABLE              ((uint32_t)0x00000002U)         /* !< Select this clock as a source */
/* SPI_CLKSEL[MFCLK_SEL] Bits */
#define SPI_CLKSEL_MFCLK_SEL_OFS                 (2)                             /* !< MFCLK_SEL Offset */
#define SPI_CLKSEL_MFCLK_SEL_MASK                ((uint32_t)0x00000004U)         /* !< Selects MFCLK as clock source if
                                                                                    enabled */
#define SPI_CLKSEL_MFCLK_SEL_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPI_CLKSEL_MFCLK_SEL_ENABLE              ((uint32_t)0x00000004U)         /* !< Select this clock as a source */
/* SPI_CLKSEL[SYSCLK_SEL] Bits */
#define SPI_CLKSEL_SYSCLK_SEL_OFS                (3)                             /* !< SYSCLK_SEL Offset */
#define SPI_CLKSEL_SYSCLK_SEL_MASK               ((uint32_t)0x00000008U)         /* !< Selects SYSCLK as clock source if
                                                                                    enabled */
#define SPI_CLKSEL_SYSCLK_SEL_DISABLE            ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPI_CLKSEL_SYSCLK_SEL_ENABLE             ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

/* SPI_PDBGCTL Bits */
/* SPI_PDBGCTL[FREE] Bits */
#define SPI_PDBGCTL_FREE_OFS                     (0)                             /* !< FREE Offset */
#define SPI_PDBGCTL_FREE_MASK                    ((uint32_t)0x00000001U)         /* !< Free run control */
#define SPI_PDBGCTL_FREE_STOP                    ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define SPI_PDBGCTL_FREE_RUN                     ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* SPI_PDBGCTL[SOFT] Bits */
#define SPI_PDBGCTL_SOFT_OFS                     (1)                             /* !< SOFT Offset */
#define SPI_PDBGCTL_SOFT_MASK                    ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define SPI_PDBGCTL_SOFT_IMMEDIATE               ((uint32_t)0x00000000U)         /* !< The peripheral will halt
                                                                                    immediately, even if the resultant
                                                                                    state will result in corruption if
                                                                                    the system is restarted */
#define SPI_PDBGCTL_SOFT_DELAYED                 ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* SPI_EVT_MODE Bits */
/* SPI_EVT_MODE[INT0_CFG] Bits */
#define SPI_EVT_MODE_INT0_CFG_OFS                (0)                             /* !< INT0_CFG Offset */
#define SPI_EVT_MODE_INT0_CFG_MASK               ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT0] */
#define SPI_EVT_MODE_INT0_CFG_DISABLE            ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define SPI_EVT_MODE_INT0_CFG_SOFTWARE           ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define SPI_EVT_MODE_INT0_CFG_HARDWARE           ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* SPI_EVT_MODE[INT1_CFG] Bits */
#define SPI_EVT_MODE_INT1_CFG_OFS                (2)                             /* !< INT1_CFG Offset */
#define SPI_EVT_MODE_INT1_CFG_MASK               ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT1] */
#define SPI_EVT_MODE_INT1_CFG_DISABLE            ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define SPI_EVT_MODE_INT1_CFG_SOFTWARE           ((uint32_t)0x00000004U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define SPI_EVT_MODE_INT1_CFG_HARDWARE           ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* SPI_EVT_MODE[INT2_CFG] Bits */
#define SPI_EVT_MODE_INT2_CFG_OFS                (4)                             /* !< INT2_CFG Offset */
#define SPI_EVT_MODE_INT2_CFG_MASK               ((uint32_t)0x00000030U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT2] */
#define SPI_EVT_MODE_INT2_CFG_DISABLE            ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define SPI_EVT_MODE_INT2_CFG_SOFTWARE           ((uint32_t)0x00000010U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define SPI_EVT_MODE_INT2_CFG_HARDWARE           ((uint32_t)0x00000020U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* SPI_INTCTL Bits */
/* SPI_INTCTL[INTEVAL] Bits */
#define SPI_INTCTL_INTEVAL_OFS                   (0)                             /* !< INTEVAL Offset */
#define SPI_INTCTL_INTEVAL_MASK                  ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define SPI_INTCTL_INTEVAL_DISABLE               ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define SPI_INTCTL_INTEVAL_EVAL                  ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* SPI_CTL0 Bits */
/* SPI_CTL0[DSS] Bits */
#define SPI_CTL0_DSS_OFS                         (0)                             /* !< DSS Offset */
#define SPI_CTL0_DSS_MASK                        ((uint32_t)0x0000001FU)         /* !< Data Size Select. Values 0 - 2 are
                                                                                    reserved and shall not be used. 3h =
                                                                                    4_BIT : 4-bit data SPI allows only
                                                                                    values up to 16 Bit */
#define SPI_CTL0_DSS_DSS_4                       ((uint32_t)0x00000003U)         /* !< Data Size Select bits: 4 */
#define SPI_CTL0_DSS_DSS_5                       ((uint32_t)0x00000004U)         /* !< Data Size Select bits: 5 */
#define SPI_CTL0_DSS_DSS_6                       ((uint32_t)0x00000005U)         /* !< Data Size Select bits: 6 */
#define SPI_CTL0_DSS_DSS_7                       ((uint32_t)0x00000006U)         /* !< Data Size Select bits: 7 */
#define SPI_CTL0_DSS_DSS_8                       ((uint32_t)0x00000007U)         /* !< Data Size Select bits: 8 */
#define SPI_CTL0_DSS_DSS_9                       ((uint32_t)0x00000008U)         /* !< Data Size Select bits: 9 */
#define SPI_CTL0_DSS_DSS_10                      ((uint32_t)0x00000009U)         /* !< Data Size Select bits: 10 */
#define SPI_CTL0_DSS_DSS_11                      ((uint32_t)0x0000000AU)         /* !< Data Size Select bits: 11 */
#define SPI_CTL0_DSS_DSS_12                      ((uint32_t)0x0000000BU)         /* !< Data Size Select bits: 12 */
#define SPI_CTL0_DSS_DSS_13                      ((uint32_t)0x0000000CU)         /* !< Data Size Select bits: 13 */
#define SPI_CTL0_DSS_DSS_14                      ((uint32_t)0x0000000DU)         /* !< Data Size Select bits: 14 */
#define SPI_CTL0_DSS_DSS_15                      ((uint32_t)0x0000000EU)         /* !< Data Size Select bits: 15 */
#define SPI_CTL0_DSS_DSS_16                      ((uint32_t)0x0000000FU)         /* !< Data Size Select bits: 16 */
/* SPI_CTL0[FRF] Bits */
#define SPI_CTL0_FRF_OFS                         (5)                             /* !< FRF Offset */
#define SPI_CTL0_FRF_MASK                        ((uint32_t)0x00000060U)         /* !< Frame format Select */
#define SPI_CTL0_FRF_MOTOROLA_3WIRE              ((uint32_t)0x00000000U)         /* !< Motorola SPI frame format (3 wire
                                                                                    mode) */
#define SPI_CTL0_FRF_MOTOROLA_4WIRE              ((uint32_t)0x00000020U)         /* !< Motorola SPI frame format (4 wire
                                                                                    mode) */
#define SPI_CTL0_FRF_TI_SYNC                     ((uint32_t)0x00000040U)         /* !< TI synchronous serial frame format */
#define SPI_CTL0_FRF_MIRCOWIRE                   ((uint32_t)0x00000060U)         /* !< National Microwire frame format */
/* SPI_CTL0[SPO] Bits */
#define SPI_CTL0_SPO_OFS                         (8)                             /* !< SPO Offset */
#define SPI_CTL0_SPO_MASK                        ((uint32_t)0x00000100U)         /* !< CLKOUT polarity (Motorola SPI frame
                                                                                    format only) */
#define SPI_CTL0_SPO_LOW                         ((uint32_t)0x00000000U)         /* !< SPI produces a steady state LOW
                                                                                    value on the CLKOUT */
#define SPI_CTL0_SPO_HIGH                        ((uint32_t)0x00000100U)         /* !< SPI produces a steady state HIGH
                                                                                    value on the CLKOUT */
/* SPI_CTL0[SPH] Bits */
#define SPI_CTL0_SPH_OFS                         (9)                             /* !< SPH Offset */
#define SPI_CTL0_SPH_MASK                        ((uint32_t)0x00000200U)         /* !< CLKOUT phase (Motorola SPI frame
                                                                                    format only) This bit selects the
                                                                                    clock edge that captures data and
                                                                                    enables it to change state. It has
                                                                                    the most impact on the first bit
                                                                                    transmitted by either permitting or
                                                                                    not permitting a clock transition
                                                                                    before the first data capture edge. */
#define SPI_CTL0_SPH_FIRST                       ((uint32_t)0x00000000U)         /* !< Data is captured on the first clock
                                                                                    edge transition. */
#define SPI_CTL0_SPH_SECOND                      ((uint32_t)0x00000200U)         /* !< Data is captured on the second
                                                                                    clock edge transition. */
/* SPI_CTL0[CSSEL] Bits */
#define SPI_CTL0_CSSEL_OFS                       (12)                            /* !< CSSEL Offset */
#define SPI_CTL0_CSSEL_MASK                      ((uint32_t)0x00003000U)         /* !< Select the CS line to control on
                                                                                    data transfer This bit is applicable
                                                                                    for both controller/target mode */
#define SPI_CTL0_CSSEL_CSSEL_0                   ((uint32_t)0x00000000U)         /* !< CS line select: 0 */
#define SPI_CTL0_CSSEL_CSSEL_1                   ((uint32_t)0x00001000U)         /* !< CS line select: 1 */
#define SPI_CTL0_CSSEL_CSSEL_2                   ((uint32_t)0x00002000U)         /* !< CS line select: 2 */
#define SPI_CTL0_CSSEL_CSSEL_3                   ((uint32_t)0x00003000U)         /* !< CS line select: 3 */
/* SPI_CTL0[CSCLR] Bits */
#define SPI_CTL0_CSCLR_OFS                       (14)                            /* !< CSCLR Offset */
#define SPI_CTL0_CSCLR_MASK                      ((uint32_t)0x00004000U)         /* !< Clear shift register counter on CS
                                                                                    inactive This bit is relevant only in
                                                                                    the peripheral, CTL1.CP=0. */
#define SPI_CTL0_CSCLR_DISABLE                   ((uint32_t)0x00000000U)         /* !< Disable automatic clear of shift
                                                                                    register when CS goes to disable. */
#define SPI_CTL0_CSCLR_ENABLE                    ((uint32_t)0x00004000U)         /* !< Enable automatic clear of shift
                                                                                    register when CS goes to disable. */
/* SPI_CTL0[PACKEN] Bits */
#define SPI_CTL0_PACKEN_OFS                      (7)                             /* !< PACKEN Offset */
#define SPI_CTL0_PACKEN_MASK                     ((uint32_t)0x00000080U)         /* !< Packing Enable. When 1, packing
                                                                                    feature is enabled inside the IP When
                                                                                    0, packing feature is disabled inside
                                                                                    the IP */
#define SPI_CTL0_PACKEN_DISABLED                 ((uint32_t)0x00000000U)         /* !< Packing feature disabled */
#define SPI_CTL0_PACKEN_ENABLED                  ((uint32_t)0x00000080U)         /* !< Packing feature enabled */

