TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_spi.h
/* SPI_TXDATA Bits */
/* SPI_TXDATA[DATA] Bits */
#define SPI_TXDATA_DATA_OFS                      (0)                             /* !< DATA Offset */
#define SPI_TXDATA_DATA_MASK                     ((uint32_t)0x0000FFFFU)         /* !< Transmit Data  When read, last
                                                                                    written value will be returned. If
                                                                                    the last write to this field was a
                                                                                    32-bit write (with PACKEN=1), 32-bits
                                                                                    will be returned and if the last
                                                                                    write was a 16-bit write (PACKEN=0),
                                                                                    those 16-bits will be returned.
                                                                                    When written, one or two FIFO entries
                                                                                    will be written depending on PACKEN
                                                                                    value. Data values are removed from
                                                                                    the transmit FIFO one value at a time
                                                                                    by the transmit logic. It is loaded
                                                                                    into the transmit serial shifter,
                                                                                    then serially shifted out onto the
                                                                                    TXD output pin at the programmed bit
                                                                                    rate.   When a data size of less than
                                                                                    16 bits is selected, the user must
                                                                                    right-justify data written to the
                                                                                    transmit FIFO. The transmit logic
                                                                                    ignores the unused bits. */
#define SPI_TXDATA_DATA_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define SPI_TXDATA_DATA_MAXIMUM                  ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_spi__include */
